ir_version: 3
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "369"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/conv.py(301): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(288): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "369"
    input: "2"
    input: "3"
    input: "4"
    input: "5"
    output: "370"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(1254): batch_norm\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/batchnorm.py(66): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(288): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "370"
    output: "371"
    op_type: "Relu"
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(624): threshold\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/activation.py(46): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(288): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "371"
    input: "7"
    output: "372"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/conv.py(301): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "372"
    input: "8"
    input: "9"
    input: "10"
    input: "11"
    output: "373"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(1254): batch_norm\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/batchnorm.py(66): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "373"
    output: "374"
    op_type: "Relu"
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(624): threshold\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/activation.py(46): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "374"
    input: "13"
    output: "375"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/conv.py(301): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "375"
    input: "14"
    input: "15"
    input: "16"
    input: "17"
    output: "376"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(1254): batch_norm\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/batchnorm.py(66): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "376"
    output: "377"
    op_type: "Relu"
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(624): threshold\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/activation.py(46): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "377"
    output: "378"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(396): max_pool2d\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/pooling.py(142): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(210): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "378"
    input: "49"
    output: "379"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/conv.py(301): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(211): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "379"
    input: "50"
    input: "51"
    input: "52"
    input: "53"
    output: "380"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(1254): batch_norm\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/batchnorm.py(66): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/container.py(91): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(211): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "377"
    input: "19"
    output: "381"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/conv.py(301): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(49): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "381"
    input: "20"
    input: "21"
    input: "22"
    input: "23"
    output: "382"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(1254): batch_norm\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/batchnorm.py(66): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(50): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "382"
    output: "383"
    op_type: "Relu"
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(624): threshold\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/activation.py(46): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(51): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "383"
    input: "25"
    output: "384"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/conv.py(301): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(53): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "384"
    input: "26"
    input: "27"
    input: "28"
    input: "29"
    output: "385"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(1254): batch_norm\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/batchnorm.py(66): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(54): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "385"
    input: "380"
    output: "386"
    op_type: "Add"
    doc_string: "/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(56): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "386"
    output: "387"
    op_type: "Relu"
    doc_string: "/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/functional.py(624): threshold\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/activation.py(46): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(57): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(214): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(290): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/practice/CenterNet_objdet2D/src/lib/models/networks/pose_dla_dcn.py(473): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(465): _slow_forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(475): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(109): forward\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/nn/modules/module.py(477): __call__\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/jit/__init__.py(77): get_trace_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(144): _trace_and_get_graph_from_model\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(177): _model_to_graph\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(226): _export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/utils.py(94): export\n/root/anaconda3/envs/CenterNet/lib/python3.6/site-packages/torch/onnx/__init__.py(26): export\nCenterNet_to_ONNX.py(35): <module>\n"
  }
  node {
    input: "387"
    input: "31"
    output: "388"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
